package ch06_loops;
/*
    Nested for - loop
    for (시작값; 한계값; 증감값) {
        반복실행문 1-a
        for (시작값; 한계값; 증감값) {
            반복실행문2
        }
        반복실행문 1-b
        for (시작값; 한계값; 증감값) {
            반복실행문3
        }
        반복실행문4
    }
    *
    **
    ***
    ****
    *****
 */
public class Loop07star {
    public static void main(String[] args) {
        for (int i = 0; i < 6; i++) {
            for (int j = 0; j < i; j++) {
                System.out.print("*");
            }
            System.out.println();
        }
        /*
             별찍기를 통한 for문 구조 학습
                            i = 0, j = 0일 경우 반복실행문2가 아예 실행되지 않습니다. 한계값이 0 < 0이 false라서
             *              i = 0, j = 0때 별이 하나 히고, i = 1 / j= 1일 때 false 라서 개핼
             **
             ***
             ****
             *****
         */
        /*
            *****
            ****
            ***
            **
            *


            100부터 1까지 역순으로 출력하시오.
         */
        for (int k = 0; k < 101; k--){
            System.out.println(k + "");
        }

        // 역순 별찍기 # 1 - 개행 담당을 굳이 -- 할 필요가 없어서 0 부터 시작하는 방법
        for ( int i = 0 ; i < 6 ; i++ ) {
            for( int j = 6 ; j > i ; j-- ) {
                System.out.print("🦑");
            }
            System.out.println();
        }

        // 역순 별찍기 # 2 - 개행 담당도 --로 처리하겠습니다.
        for ( int i = 5 ; i > 0 ; i-- ) {
            for (int j = 0; j < i; j++) {
                System.out.print("❤️");
            }
            System.out.println();
        }
    }
}
